Revit 2027 API
SystemZoneElementType.HumidificationSetPoint Property
 The humidification set point as a number between 0 and 1.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HumidificationSetPoint { get; set; }
Public Property HumidificationSetPoint As Double
	Get
	Set
public:
property double HumidificationSetPoint {
	double get ();
	void set (double value);
}
member HumidificationSetPoint : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property:
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace